Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བ་ཅན་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་གཉིས་དང་། ཐེ་ཙོམ་རྣམ་པར་བསལ་བའི་སླད་དུ་དགོངས་པ་བཤད་དུ་གསོལ།
en: Bhagavān, with heartfelt kindness for all sentient beings, I beseech you to explain the purport of the doctrine, in order to clear away all their ambivalence and doubts.

source: ཁྱོད་ནི་རིགས་དྲི་མ་མ་མཆིས་ཤིང་རྣམ་པར་དག་པ་ལགས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བདག་ཉིད་ཆེན་པོ་བཤད་དུ་གསོལ།
en: If your family is stainless and pure, bhagavān Tathāgata, then I beseech you to explain the great being Devadatta.”

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་སྤྲིན་ཆེན་སྙིང་པོས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: At that time, through the Buddha’s power, Great Cloud Essence addressed the brahmin Kauṇḍinya, the master grammarian, saying, “Great brahmin, excellent, excellent!

source: །བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་ཞུ་བའི་རྒྱལ་པོ་ལེགས་པར་ཞུས་པ་ནི་ལེགས་སོ།
en: Great brahmin, in order to benefit all sentient beings, you have questioned the Tathāgata well regarding this kingly question, which belongs to the domain of all the śrāvakas and pratyekabuddhas. Excellent!

source: །བྲམ་ཟེ་ཆེན་པོ་ཁོ་བོ་ལས་ཉོན་ཅིག་དང་། དེ་བཞིན་གཤེགས་པའི་མཐུ་དང་། ཁོ་བོ་ཅག་གི་ཡུལ་ལ་འཇུག་པའི་ཚུལ་གྱིས་ཁོ་བོས་བཤད་པར་བྱའོ།
en: Great brahmin, listen to me, and I will explain things in a manner that befits the power of tathāgatas and our own domain of activity.

source: །བྲམ་ཟེ་ད་ཕྱིན་ཆད་དེ་སྐད་མ་ཟེར་བར་གཞན་མ་ཡིན་པར་ཡིད་ལ་སོམས་ཤིག །
en: From now on, great brahmin, without saying such things, consider the following words and no others.

source: ལྷ་སྦྱིན་དྲུག་སྡེའི་འཁོར་དང་བཅས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཤིན་ཏུ་བྱས་པ་གཟོ་བ་ཡིན་ནོ།
en: Devadatta, the group of six monks, and their followers are grateful to the Tathāgata.

source: །ལྷ་སྦྱིན་ནི་མཆོག་ཏུ་དགའ་བ་བྱེད་པ་ཡིན་ནོ།
en: Devadatta is one who inspires supreme joy.

source: །ལྷ་སྦྱིན་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་སྙིང་བརྩེ་བ་ཅན་ཡིན་ནོ།
en: Devadatta loves the family of the Tathāgata.

source: །ལྷ་སྦྱིན་ནི་དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་ཀྱི་མཐའ་ཡིན་ནོ།
en: Devadatta is the culmination of the Tathāgata’s activities.

source: །ལྷ་སྦྱིན་ནི་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་བདག་ཉིད་ཆེན་པོ་སྟོན་པ་ཡིན་ནོ།
en: Devadatta is a great being who demonstrates the Tathāgata’s virtuous qualities.

source: །ལྷ་སྦྱིན་དྲུག་སྡེའི་འཁོར་དང་བཅས་པ་ནི་སེམས་ཅན་བྱེ་བ་ཕྲག་མང་པོ་བསོད་ནམས་ལ་རབ་ཏུ་འགོད་པ་ཡིན་ནོ།
en: Devadatta, the group of six monks, and their followers completely establish tens of millions of sentient beings in meritorious behavior.

source: །བྲམ་ཟེ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཁྲག་འབྱིན་མི་ནུས་སོ།
en: Great brahmin, no sentient beings are capable of drawing the blood of a tathāgata, foe-destroyer, complete and perfect buddha.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཤིང་དྲུང་གི་གྲིབ་མ་ལྟ་བུར་བལྟ་སྟེ། འདི་ནི་ཐབས་ཡིན་པར་བལྟ་བར་བྱའོ།
en: The Tathāgata’s body should be viewed as being like a tree’s shadow; you should see it as an expedient means. “

source: །བྲམ་ཟེ་ཆེན་པོ་ཤཱཀྱའི་རིགས་འདི་ནི་དག་ཅིང་རྣམ་པར་དག་ལ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Great brahmin, the family of the Śākyas is pure—inconceivably pure.

source: །ཤཱཀྱའི་རིགས་ཀྱི་ནང་ན་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་འགའ་ཙམ་ཡང་མེད་དེ་མི་སྲིད་དོ།
en: Within the Śākya family, it is impossible for there to be even a few whose discipline is lax.

source: །དེ་བཞིན་གཤེགས་པ་ནི་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་ཡིན་ནོ།
en: The Tathāgata teaches the doctrine of the existence of fruition.

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཙན་དན་དང་བཻ་དཱུརྱ་ལྟ་བུའི་འཁོར་དང་ལྡན་པ་ཡིན་ནོ།
en: The Tathāgata’s followers are like sandalwood and beryl.

source: །དེ་བཞིན་གཤེགས་པ་ནི་མི་ཕྱེད་པའི་འཁོར་དང་ལྡན་པ་ཡིན་ནོ།
en: The Tathāgata’s following is undivided.

source: །དེ་བཞིན་གཤེགས་པ་ནི་སེང་གེའི་རིགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་དང་། སྟག་ལྟ་བུའི་འཁོར་དང་ལྡན་པ་ཡིན་ནོ།
en: The Tathāgata’s followers are like tigers and great lion kings.

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་འཁོར་དང་ལྡན་པ་ཡིན་ནོ།
en: The Tathāgata’s followers belong to the inconceivable domain of all śrāvakas and pratyekabuddhas.

source: །དེ་བཞིན་གཤེགས་པའི་འཁོར་ནི་མེ་མདག་ཐལ་བས་གཡོགས་པ་ལྟ་བུར་བལྟའོ།
en: The Tathāgata’s followers should be seen as like fiery coals covered with ashes.

source: །དེ་བཞིན་གཤེགས་པ་ནི་བླ་ན་མེད་པའོ།
en: The Tathāgata is unsurpassed.

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པའོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: The Tathāgata is omniscient.

source: །དེ་བཞིན་གཤེགས་པ་ལས་རབ་ཏུ་བྱུང་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་མི་སྲིད་དེ།
en: It is impossible for sentient beings who have followed the Tathāgata in going forth to renunciation to have lax discipline.

source: དེ་དག་ཐམས་ཅད་ནི་ཡུལ་ཟབ་མོ་ཤེས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་འགོད་པ་ཤ་སྟག་སྟེ།
en: Those beings are all completely established in the understanding of all profound domains.

source: དེའི་ཕྱིར་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: Therefore, the Tathāgata is himself omniscient. “

source: །བྲམ་ཟེ་ཆེན་པོ་དགེ་འདུན་ནི་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་གིས་ཀྱང་དབྱེ་བར་མི་ནུས་ཏེ། འདི་ནི་ཐབས་ཡིན་པར་བལྟ་བར་བྱའོ།
en: Great brahmin, even trillions of māras could not divide the saṅgha. This schism within the saṅgha should be viewed as an expedient means.

source: །ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་དགེ་འདུན་གྱི་དབྱེན་བྱེད་པ་ཡང་མ་ཡིན་ནོ།
en: Devadatta and the group of six monks do not create schism among the saṅgha.

source: །ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་ཤཱཀྱའི་རིགས་སྟོན་པ་ཡིན་ནོ།
en: Devadatta and the group of six monks represent the Śākya family.

source: །སྐྱེ་བོ་ཕལ་པ་ཡང་དུད་འགྲོར་སྐྱེ་བར་འགྱུར་བ་ཡོངས་སུ་མི་སྤྱོད་ན་ཤཱཀྱའི་རིགས་སུ་སྐྱེས་ལ།
en: They do not conduct themselves in such a way as to be born as animals or among ordinary people.

source: དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་ནས་རབ་ཏུ་བྱུང་བ་འདི་ལྟ་བུའི་ལས་ལ་སྦྱོར་བ་ལྟ་ཅི་སྨོས་ཏེ་དེ་ནི་གནས་མེད་དོ།
en: Having been born in the Śākya family and gone forth to renunciation at the feet of the Tathāgata, what need is there to say that they do not engage in such actions? The idea is unfounded.

source: །ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པས་ཤིན་ཏུ་བྱམས་པར་བྱས་པ་ཡིན་ནོ།
en: Devadatta and the group of six monks act very kindly.

source: །ལྷ་སྦྱིན་ནི་ངུར་སྨྲིག་འཆང་བ་ཙམ་དུ་ཟད་པ་ཡང་མ་ཡིན་ནོ།
en: Devadatta does not merely wear the saffron-colored robes.

source: །ལྷ་སྦྱིན་ནི་མུ་གེའི་མགོ་བྱི་ཡང་མ་ཡིན་ནོ།
en: Devadatta is not a famished bald-head.

source: །ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་པ་ཡིན་ནོ།
en: Devadatta and the group of six monks are bound by the pratimokṣa vows.

source: །ལྷ་སྦྱིན་ནི་སྡིག་པ་ལ་ངེས་པ་ཡང་མ་ཡིན་ནོ།
en: Devadatta is not determined to do evil.

source: །ལྷ་སྦྱིན་ནི་སྡིག་པ་འདོད་པ་ཡང་མ་ཡིན་ནོ།
en: Devadatta does not desire to do evil.

source: །ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་ཐབས་ཀྱི་དགེ་སློང་ཡིན་པར་རིག་པར་བྱའོ།
en: Devadatta and the group of six monks should be known as monks representing the Tathāgata’s expedient means.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་རྟག་ཏུ་ཡང་མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ན་རྩེ་བར་བྱེད་དེ།
en: All bodhisattvas play within the hell realms by means of the superknowledges.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཡིན་པར་བལྟའོ།
en: This should be seen as the domain of bodhisattvas.

source: །ལྷ་སྦྱིན་ནི་སེམས་ཅན་དམྱལ་བར་འགྲོ་བ་ཡང་མ་ཡིན་ནོ།
en: Devadatta will not go to the hell realms. “

source: །བྲམ་ཟེ་ཆེན་པོ་གཞན་ཡང་ལྟོས་དང་།
en: Moreover, great brahmin, please listen!

source: དཔེར་ན་ཡུལ་གཞན་གྱི་འདྲོན་པ་མི་གཉིས་ཤིག་གྲོང་ཁྱེར་གཞན་ཞིག་ན་འདུག་འདུག་པ་ལས་ཕྱིར་རང་རང་གི་ཡུལ་དུ་འགྲོ་བར་ཆས་ཏེ། གཅིག་ནི་ནུབ་ཕྱོགས་སུ་སོང་། གཅིག་ནི་ཤར་ཕྱོགས་སུ་སོང་ན། ཇི་ཙམ་དུ་སོང་བ་དེ་ཙམ་དུ་གྲོང་ཁྱེར་དང་ཤིན་ཏུ་རིང་བར་འགྱུར་རོ།
en: To give an analogy, it is like two travelers who have come from other lands to a foreign city. They each set out to return to their own lands, one going to the west and one going to the east. The farther they each go, the farther behind each of them has left that foreign city.

source: །ཇི་ཙམ་དུ་སོང་བ་དེ་ཙམ་དུ་མི་དེ་གཉིས་ཕྱིར་ཕྲད་པར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ།
en: It is unfounded to say that the farther they go, the closer they will come to meeting again.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དང་ལྷ་སྦྱིན་གཉིས་ཀྱང་གལ་ཏེ། ཐབས་ཤིག་མ་ཡིན་དུ་ཟིན་ན་ཁྱད་ཆེ་བར་མངོན་ནོ།
en: In this fashion, great brahmin, if it were the case that the Tathāgata and Devadatta are not connected as you hold, then it would be very obvious.

source: །བྲམ་ཟེ་ཆེན་པོ་གཞན་ཡང་འདིར་མི་ལ་ལ་ཞིག་གིས་སྲོག་གཅོད་པ་བྱས་ན་ལོ་བརྒྱ་ཕྲག་མང་པོར་སེམས་ཅན་དམྱལ་བར་བསྲེག་པར་འགྱུར་ལ།
en: Moreover, great brahmin, if a certain person performs an act of killing, they will burn in the hell realms for many hundreds of years.

source: བསོད་ནམས་བྱས་ན་ལོ་བྱེ་བ་སྙེད་དུ་མཐོ་རིས་སུ་མངོན་པར་རྩེ་བར་འགྱུར་བས་ན་བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ནི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་ཞིང་བག་ཆགས་ཀྱི་ཚོགས་ཀྱིས་བསྒོས་པ་མ་ཡིན་པས།
en: If they perform meritorious acts, they will frolic in the higher realms for as many as ten million years. Great brahmin, the Tathāgata possesses inconceivable virtuous qualities and is not tainted by the host of latent karmic tendencies.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ལྷ་སྦྱིན་གྱིས་བགྲོངས་པར་བསམས་སུཟིན་ན། དེ་ལྟར་སེམས་གཅིག་བསྐྱེད་པ་ཙམ་གྱི་ལས་ཀྱི་འབྲས་བུ་དེས་ཀྱང་ལོ་བྱེ་བ་ཕྲག་གྲངས་མེད་དཔག་ཏུ་མེད་པ། བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་སྲིད་དུ་སེམས་ཅན་དམྱལ་བར་ཤིན་ཏུ་བསྲེག་པར་འགྱུར་བའི་རིགས་ན།
en: Therefore, if Devadatta held the thought of killing the Tathāgata, then it would be reasonable to suppose that the karmic fruition of even generating that single thought would cause him to burn in the hell realms for countless lifetimes throughout tens of millions of unfathomable, countless great eons.

source: བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ནི་བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་བྱེ་བ་གྲངས་མེད་པ་མང་པོ་ཡུན་རིང་པོ་ནས་དགྲ་ལས་འདས་པ་ཡིན་ལ།
en: Great brahmin, for the long duration of many countless trillions of eons, the Tathāgata has transcended all foes.

source: དེ་བཞིན་གཤེགས་པ་དང་ལྷ་སྦྱིན་སེམས་ཅན་དམྱལ་བ་ན་བསྲེགས་པ་གཉིས་ཀྱང་ཕྲད་པར་ག་ལ་འགྱུར་ཏེ་དེ་ནི་གནས་མེད་དོ།
en: If Devadatta were burning in the hell realms, how would the Tathāgata ever encounter him? This idea is unfounded. “

source: །བྲམ་ཟེ་ཆེན་པོ་གཞན་ཡང་གལ་ཏེ་ལྷ་སྦྱིན་སྡིག་པས་འཚོ་བ་ཞིག་ཡིན་དུ་ཟིན་ན་སྐྱེས་པའི་རབས་བརྒྱ་སྟོང་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། ལྷ་སྦྱིན་ལྷན་ཅིག་ཏུ་ཕྲད་ཅིང་འགྲོགས་པར་ཡང་ཇི་ལྟར་འགྱུར་ཏེ་དེ་ནི་གནས་མེད་དོ།
en: Moreover, great brahmin, if you hold that Devadatta is one who lives a life of evil, then how is it that throughout hundreds of thousands of former lives the tathāgata, foe-destroyer, complete and perfect Buddha has encountered and been accompanied by Devadatta? This idea is unfounded.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: ཇི་ཙམ་དུ་ལྷ་སྦྱིན་བཅོམ་ལྡན་འདས་བགྲོངས་པར་སེམས་པ་དེ་ཙམ་དུ་སེམས་ཅན་དམྱལ་བར་ངེས་པར་བསྲེག་པར་འགྱུར་བས་ན།
en: Devadatta would certainly burn in the hell realms for as long as he had the thought of killing the Tathāgata.

source: ཇི་ལྟར་སེམས་ཅན་དམྱལ་བ་ཡང་ཉམས་སུ་མྱོང་ལ་དེ་བཞིན་གཤེགས་པ་བགྲོངས་པར་ཡང་ཇི་ལྟར་སེམས་པར་རུང་སྟེ། མི་དེ་གཉིས་ཇི་ལྟར་ན་མས་ཀྱང་ཕྲད་པར་མི་འགྱུར་བ་དེ་བཞིན་དུ་བྲམ་ཟེ་ཆེན་པོ་ལྷ་སྦྱིན་དེ་ལྟ་བུ་དང་། དེ་བཞིན་གཤེགས་པ་ཡང་བརྒྱ་ལམ་ན་ཡང་ཕྲད་པར་འགྱུར་བ་དེ་ནི་གནས་མེད་དོ།
en: Therefore, given that Devadatta would be suffering in the hell realms for as long as he was thinking thus of killing the Tathāgata, how would these two men ever be able to encounter each other? Great brahmin, it would be unfounded to say, following this, that Devadatta never encountered the Tathāgata. “

source: །བྲམ་ཟེ་ཆེན་པོ་གཞན་ཡང་གལ་ཏེ་ལྷ་སྦྱིན་སྡིག་ཅན་གཅིག་ཏུ་ཟིན་ན། ཤར་ཕྱོགས་སུ་འགྲོ་བ་བཞིན་དུ་ལྷ་སྦྱིན་དེ་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་བར་རིག་པར་བྱའོ།
en: Moreover, great brahmin, if you hold that Devadatta is an evil person, then you should think of Devadatta going to the hell realms as like the traveler who goes to the east.

source: །གང་ནུབ་ཕྱོགས་སུ་འགྲོ་བ་ལྟ་བུ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should think of the Tathāgata as the traveler who goes to the west.

source: །དེ་ལ་གྲོང་ཁྱེར་གང་ཡིན་པ་དེ་ནི་རྟག་ཏུ་འཇིགས་པ་མེད་པའི་གྲོང་ཁྱེར་ཡིན་པར་རིག་པར་བྱ་སྟེ། འདི་ནི་ཐབས་ཡིན་པར་བལྟ་བར་བྱའོ།
en: And what is that city? You should think of it as the city of permanent fearlessness; this you should see as skillful means.

source: །སངས་རྒྱས་ཀྱི་ཡུལ་འདི་ནི་ཁོ་བོ་ཅག་གིས་ཀྱང་བསམ་པར་མི་ནུས་པར་རིག་པར་བྱའོ།
en: You should know that we cannot conceive of the domain of the Tathāgata.

source: །ལྷ་སྦྱིན་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཡིན་གྱི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་མ་ཡིན་ནོ།
en: Devadatta belongs to the domain of the Tathāgata, not the domain of the śrāvakas and pratyekabuddhas. “

source: །བྲམ་ཟེ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེར་པོ་ཆེན་པོ་ཞེས་བྱ་བས་གདམས་ངག་བསྟན་ནས་བྱང་ཆུབ་སེམས་དཔའ་དྲུག་སྡེ་རྣམས་ཀྱི་འཁོར་གྱིས་བསྐོར་བ་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: Great brahmin, you should rejoice in Devadatta as the bodhisattva mahāsattva named Mahākapila, who, after giving instruction, was surrounded by a group of six bodhisattvas.

source: བྲམ་ཟེ་ཆེན་པོ་དཔེར་ན། གླང་པོ་ཆེ་མཆོག་ལ་བརྡེག་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བོང་བུས་ཤིན་ཏུ་མི་བཟོད་དེ། གླང་པོ་ཆེ་མཆོག་ལ་བརྡེག་པར་བྱ་བ་ནི་གླང་པོ་ཆེ་མཆོག་གིས་བཟོད་པར་ཟད་དོ།
en: Great brahmin, by analogy, it is like a donkey who could not withstand the beating that a great elephant receives; only the great elephant could withstand such a beating.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་རྭས་བརྡུང་བ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བོང་བུས་ཤིན་ཏུ་མི་བཟོད་དེ།
en: Great brahmin, similarly, when beaten with the goad of the concealed intent of the Tathāgata’s speech, donkeys such as the śrāvakas and pratyekabuddhas cannot withstand it.

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་རྭས་བརྡུངས་པ་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བས་བཟོད་པར་ཟད་དོ།
en: Only those who are like the Tathāgata can stand to be beaten with the goad of the concealed intent of the Tathāgata’s speech. “

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Great brahmin, see the greatness of the Tathāgata’s virtuous qualities!

source: བྲམ་ཟེ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེར་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱིས་བསྐོར་བ་ལ་བཟོད་པ་གསོལ་ཅིག །
en: Great brahmin, you should request forgiveness from the bodhisattva mahāsattva Mahākapila, who is surrounded by his retinue of bodhisattvas!

source: བྲམ་ཟེ་ཆེན་པོ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་ལྷ་སྦྱིན་གྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་མི་ཤེས་པ་དེ་དག་ནི་སངས་རྒྱས་བྱུང་བའི་ཕྱེད་ཐོབ་ཙམ་དུ་ཟད་པ་ཡིན་པར་རིག་པར་བྱའོ། །མིག་ཡ་གཅིག་པར་རིག་པར་བྱའོ། །མི་ལུས་ཀྱི་ཕྱེད་ཐོབ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Great brahmin, you should know that those who do not recognize the greatness of the virtuous qualities of Devadatta—whether monks, nuns, laymen, or laywomen—have only half attained the arising of buddhahood; they have only one eye, and they have attained only half a human body. “

source: །བྲམ་ཟེ་ཆེན་པོ་གཞན་ཡང་ལྷ་སྦྱིན་གྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ལ་ལྟོས།
en: Moreover, great brahmin, behold the greatness of Devadatta’s virtuous qualities!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ནི་དེ་བཞིན་གཤེགས་པའི་གནོད་པ་བཟོད་པར་ཡང་མི་ནུས། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཤེས་པར་ཡང་མི་ནུས། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་མཐོང་བར་ཡང་མི་ནུས། དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བར་ཡང་མི་ནུས་སོ།
en: No sentient beings could bear to harm the Tathāgata, nor are they capable of recognizing the greatness of the Tathāgata’s virtuous qualities, of beholding the domain of the Tathāgata, or of seeing the Tathāgata.

source: །བྲམ་ཟེ་ཆེན་པོ་ལྷ་སྦྱིན་གྱིས་དེ་བཞིན་གཤེགས་པའི་གནོད་པ་བཟོད་པར་ཡང་ནུས་སོ། །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱང་རྟོགས་སོ།
en: Great brahmin, Devadatta was able to bear harming the Tathāgata, and he realized the greatness of the Tathāgata’s qualities.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་མ་ཡིན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་ཡང་རྣམ་པར་འཕྲུལ་པར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕྲིན་ལས་ཡང་དག་པར་སྟོན་པར་ཡང་ནུས་སོ།
en: He was able to magically manifest the magical manifestation of all the tathāgatas, which does not belong to the domain of the śrāvakas or pratyekabuddhas, and to perfectly display the virtuous qualities of all the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་འདྲ་བའི་སྐྱེས་བུ་ཆེན་པོ་ཡིན་པར་ཡང་བལྟ་བར་བྱའོ།
en: You should regard him as a great being whose domain is equal to that of the Tathāgata.

source: །འདུལ་བའི་དབང་གིས་དེ་བཞིན་གཤེགས་པ་གང་དང་གང་དུ་སྣང་བར་འགྱུར་བ་དེ་དང་དེར་སྐྱེས་བུ་ཆེན་པོ་དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་ཕྱི་བཞིན་དུ་འབྲང་ཞིང་སྣང་བར་འགྱུར་རོ།
en: Wherever the Tathāgata has appeared through his power to tame sentient beings, there this great being Devadatta has also appeared, following closely behind the Tathāgata.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ནི་ཁོ་བོ་ཅག་གིས་ཀྱང་བསྟན་པར་མི་ནུས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཐབས་ཡིན་པར་བལྟ་བར་བྱའོ།
en: Great brahmin, we are not capable of revealing the domain of the Tathāgata; you should regard this as the Tathāgata’s skillful means.

source: །དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་སྒོའི་ཡུལ་གྱི་ཆོས་བསྟན་པ་ལ་ལྟོས།
en: See this Dharma teaching on the domain of the gateways of the concealed intent of the Tathāgata’s speech!”

source: དེ་ནས་དེའི་ཚེ་འཁོར་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོའི་ལས་བྱས་ནས་ཁ་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །བདུད་རྣམས་བྱེ་བ་ཕྲག་བརྒྱས་ཀྱང་། །དགེ་འདུན་དབྱེ་བར་མི་ནུས་ཏེ། །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ལས་ཀྱི་རྒྱུ་བའང་སྟོན་པར་མཛད།
en: At that time, the entire retinue made great offerings to the Bhagavān and then with one voice spoke these verses: “Even a billion māras Could not divide the saṅgha; As medicine for all sentient beings, You have demonstrated these karmic causes.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྤྲིན་ཆེན་སྙིང་པོ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān then replied to the bodhisattva Great Cloud Essence, “Excellent, Great Cloud Essence, excellent!

source: །དེ་དེ་བཞིན་ཏེ།
en: So it is.

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་མི་མཚུངས་པ་དང་། ལྷ་སྦྱིན་གྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་གཞི་གཞག་པའི་ཕྱི་རོལ་གྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅད་པའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ།
en: Great Cloud Essence, in order to eradicate the doubts of all outsider sentient beings, you have given this excellent explanation. On the basis of the Tathāgata’s concealed speech, you have explained the domain of the Tathāgata—which is not the same as that of the śrāvakas and pratyekabuddhas—and the greatness of Devadatta’s virtuous qualities. Excellent, excellent! Great Cloud Essence.

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཟབ་མོ་བསྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་རིའི་རྒྱལ་པོ་རི་རབ་དེ་ཙམ་དུ་མཐོ་ཞིང་། དེ་ཙམ་དུ་རྒྱ་ཆེ་ལ། དེ་ཙམ་དུ་ཡུལ་དུ་བྱས་པ། དེ་ཙམ་དུ་བཙན་པ་ཡུངས་འབྲུའི་ནང་དུ་ཆུད་པར་བྱེད་དེ། འོན་ཀྱང་ཡུངས་འབྲུའི་ནང་ན་ཡང་སྐྱེ་བར་མི་འགྱུར་ཞིང་།
en: Moreover, bodhisattva mahāsattvas who abide in the domain of the samādhi of the tide of the deep, constant ocean are able to take something as lofty and vast as Mount Meru, the king of mountains—with its great height and breadth, its great domain and power—and insert it into a mustard seed, without the inside of the mustard seed growing any larger.

source: བྱ་བ་བྱེད་པ་དེ་དག་ཀྱང་སྣང་ལ། རྒྱལ་ཆེན་བཞི་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་ཀྱིས་ཀྱང་བདག་ཅག་གང་དུ་བཅུག་པ་དང་། བདག་ཅག་གང་ན་འཁོད་པ་ཡང་མི་ཚོར་རོ།
en: Furthermore, after the display of such a deed, the Four Great Kings and the gods of the Heaven of the Thirty-Three would not even sense that ‘we have been inserted somewhere; we have been placed somewhere.’

source: །སེམས་ཅན་གཞན་དག་གིས་ནི་རིའི་རྒྱལ་པོ་རི་རབ་ཡུངས་འབྲུའི་ནང་དུ་བཅུག་པར་ཡང་ཤེས་ཤིང་མཐོང་ངོ་།
en: Other sentient beings, however, would see and know that Mount Meru, the king of mountains, had been inserted into a mustard seed.

source: །སྤྲིན་ཆེན་སྙིང་པོ་ཟབ་མོ་བསྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་ཡུལ་ལ་འཇུག་པ་ལ་ལྟོས།
en: Great Cloud Essence, see how one engages with the domain of liberation of the samādhi of the tide of the deep, constant ocean! “

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆུའི་ཕུང་པོ་འདི་བ་སྤུ་གཅིག་གི་ཁུང་དུ་ཆུད་པར་བྱེད་དེ། འོན་ཀྱང་ཉ་དང་། རུ་སྦལ་དང་། སྦལ་པ་དང་།
en: Moreover, Great Cloud Essence, bodhisattvas who abide in the domain of the samādhi of the tide of the deep, constant ocean can insert the entire great mass of water of the four oceans into a single hair-pore, without all the fish, turtles, frogs, porpoises, crocodiles, makara fish, water dwellers, water snakes, tirikara, and other similar aquatic creatures suffering any harm.

source: ཆུ་སྲིན་བྱིས་པ་གསོད་དང་ཆུ་སྲིན་དང་ཆུ་སྲིན་ས་ལ་པ་དང་། ཨོ་ད་ཀ་དང་། ཆུ་སྦྲུལ་དང་། ཏི་རི་ཀ་ར་ལ་སོགས་པ་དང་། དེ་བཞིན་དུ་ཆུའི་སྲོག་ཆགས་གཞན་དག་ལ་ཡང་གནོད་པར་འགྱུར་བ་མེད་དོ།
en: The nāgas, gandharvas, and asuras would also not think that ‘we have been inserted somewhere; we have been placed somewhere.’

source: །ཀླུ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་རྣམས་ཀྱང་བདག་ཅག་གར་བཅུག །བདག་ཅག་གང་ན་འཁོད་སྙམ་དུ་སེམས་པ་མེད་ལ།
en: Moreover, after the display of such a deed, sentient beings would be free from harm and harassment.

source: བྱ་བ་དེ་ཡང་སྣང་སྟེ། སེམས་ཅན་སུ་ལ་ཡང་གཙེ་བ་འམ་ཐོ་བཙམ་པ་མེད་དོ།
en: Furthermore, such bodhisattvas could break off this great trichiliocosm world-system and, holding it in their right hand like a shield, hurl it spinning so that it passes beyond as many world systems as there are grains of sand in the Ganges River, without sentient beings noticing that ‘someone has picked us up; we have been placed somewhere.’

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་བཅད་དེ། ཕུབ་ཟླུམ་བཞིན་དུ་ལག་པ་གཡས་པས་བསྐོར་ནས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཟློ་བར་བྱེད་དེ། འོན་ཀྱང་སེམས་ཅན་རྣམས་ཀྱིས་བདག་ཅག་སུས་ཁྱེར་བ་དང་། བདག་ཅག་གང་ན་འཁོད་པ་ཡང་མི་ཚོར་རོ།
en: Such bodhisattvas could again pick up this world system and put it back in its original place, without anyone realizing that it had come and gone in such a fashion after the display of such deeds.”

source: །ཕྱིར་ཡང་ཁྱེར་ཏེ་འོངས་ནས་སྔ་མའི་གནས་སུ་འཇོག་པར་བྱེད་དེ། འོན་ཀྱང་འགྲོ་བ་དང་། འོང་བར་ཡང་མི་མངོན་ལ་བྱ་བ་དེ་དག་ཀྱང་སྣང་ངོ་།
en: At that time, the brahmin Kauṇḍinya, the master grammarian, together with hundreds of thousands of brahmin youths, made offerings to the Bhagavān.

source: །དེ་ནས་དེའི་ཚེ་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་དང་བྲམ་ཟེ་གཞོན་ནུ་བརྒྱ་སྟོང་དུ་མ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་ཞིང་། གལ་ཏེ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ལ་སྒྲ་གཅན་ཟིན་བཞིན་དུ་གཟིགས་ན། བདག་ལ་དམ་པ་གཅིག་སྩལ་དུ་གསོལ།
en: They addressed him, saying, “If the Bhagavān has compassion for all sentient beings, if you regard all sentient beings as being just like your son Rāhula, then please grant us a single boon!”

source: བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ནས་སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་ཆེན་པོའི་ནང་ནས་ལིད་ཚ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ཞེས་བྱ་བས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་བཅོམ་ལྡན་འདས་ལ་དམ་པ་ཞིག་གསོལ་ལམ།
en: The Bhagavān remained silent, but through his powers of buddhahood he caused a Licchavi youth named Admired by All Worlds to emerge from the great assembly and address the brahmin Kauṇḍinya, the master grammarian, saying, “Great brahmin, what boon would you request from the Bhagavān?

source: བདག་གིས་ཁྱོད་ལ་དམ་པ་སྦྱིན་ནོ།
en: I shall grant you a boon.”

source: །བྲམ་ཟེས་སྨྲས་པ།
en: The brahmin said,
